
<img src="../img/Snip20190927_26.png"/>

In [12]:
%reload_ext sql

In [13]:
%sql mysql+pymysql://dbbook:password@localhost:3306

'Connected: dbbook@None'

In [16]:
%%sql

use dbbook;

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [17]:
%%sql

-- find the titles of courses
-- in the Comp. Sci. department that have 3 credits

SELECT title FROM course WHERE dept_name='Comp. Sci.' AND credits=3;

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
3 rows affected.

[('International Finance',), ('Computability Theory',), ('Japanese',)]

In [31]:
%%sql

-- Find the IDs of all studenst who were taught by an instructor named
-- Einstein; remove duplicates

-- JOIN USING: useful when both tables share a column of the same name,
--             remove duplicated columns
-- JOIN ON: does not remove duplicated columns

-- SELECT DISTINCT student.ID
-- FROM (student JOIN takes USING(ID))
-- JOIN (instructor JOIN teaches USING (ID))
-- USING (course_id, sec_id, semester, year)
-- WHERE instructor.name = 'Einstein'

SELECT DISTINCT s.ID AS ID
FROM student s
JOIN takes ta USING(ID)
JOIN (instructor i JOIN teaches te USING(ID))
    USING (course_id, sec_id, semester, year)
WHERE i.name='Einstein'

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [26]:
%%sql

-- find the highest salary of any instructor

SELECT MAX(salary) FROM instructor;

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(Decimal('124651.41'),)]

In [33]:
%%sql

-- find all instructors earning the highest salary

SELECT ID FROM instructor WHERE salary =
(SELECT MAX(salary) FROM instructor);

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('19368',)]

In [43]:
%%sql

-- find the enrollment of each section that was offered in Fall 2009

SELECT course_id, sec_id, count(t.ID) AS enrollment
FROM section s
LEFT OUTER JOIN takes t USING (course_id, sec_id, semester, year)
WHERE semester='Fall' AND year=2009
GROUP BY course_id, sec_id

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
7 rows affected.

[('105', '1', 327),
 ('237', '2', 311),
 ('242', '1', 295),
 ('304', '1', 307),
 ('334', '1', 268),
 ('486', '1', 304),
 ('960', '1', 307)]

In [44]:
%%sql

-- find the maximum enrollment, across all sections, in Fall 2009

SELECT MAX(enrollment) FROM
(
    SELECT count(ID) AS enrollment
    FROM takes
    WHERE semester='Fall' AND year=2009
    GROUP BY course_id, sec_id
) AS enrollments

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(327,)]

In [48]:
%%sql

-- find the sections that had the maximum enrollment in Autumn 2009

SELECT course_id, sec_id
FROM section
NATURAL LEFT OUTER JOIN takes
WHERE semester='Fall' AND year=2009
GROUP BY course_id, sec_id
HAVING count(ID) = (
    SELECT MAX(enrollment) FROM
    (
        SELECT count(ID) AS enrollment
        FROM takes
        WHERE semester='Fall' AND year=2009
        GROUP BY course_id, sec_id
    ) AS enrollments
)

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('105', '1')]

<img src="../img/Snip20190929_38.png" width=80%/>

In [51]:
%%sql

-- find the total number of people who owned cars
-- that were involved in accidents in 2009

SELECT COUNT (DISTINCT owns.driver_id)
FROM (participated NATURAL JOIN accident)
JOIN owns USING (license)
WHERE date BETWEEN '2009-01-01' AND '2009-12-31';

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'DISTINCT( driver_id)\nFROM participated' at line 4")
[SQL: -- find the total number of people who owned cars
-- that were involved in accidents in 2009

SELECT COUNT DISTINCT( driver_id)
FROM participated]
(Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
%%sql

-- unverified
-- add a new incident to the database; assume any values for required attributes

INSERT INTO accident VALUES(4007, '2001-09-01', 'Berkeley')

INSERT INTO participated
SELECT 4007, license, driver_id, 3000
FROM (person NATURAL JOIN owns NATURAL JOIN car)
WHERE name = 'Jones' AND model='Toyota'

In [ ]:
%%sql

-- unverified
-- delete the Mazda belonging to "John Smith"

DELETE FROM car
WHERE model='Mazda' AND license IN(
    SELECT license
    FROM (person NATURAL JOIN owns)
    WHERE name='John Smith'
)

<img src="../img/Snip20190929_39.png" width=60%/>

In [ ]:
%%sql

-- find the names and cities of residence of all employees
-- who work for "First Bank Corporation"

SELECT employee_name, city
FROM (employee NATURAL JOIN works)
WHERE company_name="First Bank Corporation"

In [52]:
%%sql

-- find the names, street, and city of all employees
-- who work for "First Bank Corporation" and earn more than 10000

SELECT DISTINCT (employee_name, street, city)
FROM (employee NATURAL JOIN works)
WHERE company_name="First Bank Corporation" AND salary > 10000

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1146, "Table 'dbbook.employee' doesn't exist")
[SQL: -- find the names, street, and city of all employees
-- who work for "First Bank Corporation" and earn more than 10000

SELECT DISTINCT (employee_name, street, city)
FROM (employee NATURAL JOIN works)
WHERE company_name="First Bank Corporation" AND salary > 10000]
(Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
%%sql

-- find all employees in the database who do not work for "First Bank Corporation"

-- NOPE
SELECT * 
FROM employee
WHERE employee_name NOT IN
(
    SELECT DISTINCT employee_name
    FROM (employee NATURAL JOIN works)
    WHERE company_name="First Bank Corporation"
)

-- WOW
SELECT DISTINCT employee_name
FROM works
WHERE company_name <> 'First Bank Corporation'

In [ ]:
%%sql

-- find all employees who earn more than each employee of "Small Bank Corporation"

SELECT employee_name
FROM works
WHERE salary > (
    SELECT MAX(salary)
    FROM works
    WHERE company_name="Small Bank Corporation"
)

In [ ]:
%%sql

-- find all companies located in every city in which "Small Bank Corporation" is located

SELECT DISTINCT company_name
FROM company 
WHERE city IN (
    SELECT city
    FROM company
    WHERE company_name="Small Bank Corporation"
)

In [ ]:
%%sql

-- find the company that has the most employees

SELECT company_name
FROM works
GROUP BY company_name
HAVING COUNT(DISTINCT employee_name) = (
    SELECT MAX(employee_count) FROM (
        SELECT COUNT(DISTINCT employee_name) as employee_count
        FROM works
        GROUP BY company_name
    ) as employee_counts
)

In [54]:
%%sql

-- find the companies who have higher avg salary than "First Bank Corporation"

SELECT company_name
FROM works
GROUP BY company_name
HAVING AVG(salary) > (
    SELECT avg(salary)
    FROM works
    WHERE company_name = "First Bank Corporation"
)

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1146, "Table 'dbbook.works' doesn't exist")
[SQL: -- find the companies who have higher avg salary than "First Bank Corporation"

SELECT company_name
FROM works
GROUP BY company_name
HAVING AVG(salary) > (
    SELECT avg(salary)
    FROM works
    WHERE company_name = "First Bank Corporation"
)]
(Background on this error at: http://sqlalche.me/e/f405)

In [57]:
%%sql

-- find all employees who live in the same cities as the companies in which they work

SELECT employee_name
FROM (employee NATURAL JOIN works)
JOIN company USING (company_name)
WHERE employee.city = company.city

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1146, "Table 'dbbook.employee' doesn't exist")
[SQL: -- find all employees who live in the same cities as the companies in which they work

SELECT employee_name
FROM (employee NATURAL JOIN works)
JOIN company USING (company_name)
WHERE employee.city = company.city]
(Background on this error at: http://sqlalche.me/e/f405)

In [61]:
%%sql

-- find all employees who live in the same cities and streets as do their managers

WITH managers (employee_name, street, city) AS (
    SELECT e.*
    FROM employee e
    JOIN manages m ON (e.employee_name = m.manager_name)
)

SELECT employee_name
FROM employee e
NATURAL JOIN manages ms
JOIN managers mr ON ms.manager_name = mr.employee_name
WHERE e.street = mr.street AND e.city = mr.city

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'managers(employee_name, street, city) AS (\n    SELECT e.*\n    FROM employee e\n  ' at line 3")
[SQL: -- find all employees who live in the same cities and streets as do their managers

WITH managers(employee_name, street, city) AS (
    SELECT e.*
    FROM employee e
    JOIN manages m ON (e.employee_name = m.manager_name)
)

SELECT employee_name
FROM employee e
NATURAL JOIN manages ms
JOIN managers mr ON ms.manager_name = mr.employee_name
WHERE e.street = mr.street AND e.city = mr.city]
(Background on this error at: http://sqlalche.me/e/f405)

In [62]:
%%sql

-- find all employees who earn more than the average of all employees of their company

SELECT employee_name
FROM works w NATURAL LEFT JOIN (
    SELECT company_name, AVG(salary) AS salary
    FROM works
    GROUP BY company_name
) AS avg
WHERE salary > avg.salary

-- solution

SELECT *
FROM employee E
WHERE salary > (
    SELECT avg(salary)
    FROM works
    WHERE company_name = E.company_name
)

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1146, "Table 'dbbook.works' doesn't exist")
[SQL: -- find all employees who earn more than the average of all employees of their company

SELECT employee_name
FROM works w NATURAL LEFT JOIN (
    SELECT company_name, AVG(salary) AS salary
    FROM works
    GROUP BY company_name
) AS avg
WHERE salary > avg.salary]
(Background on this error at: http://sqlalche.me/e/f405)

In [63]:
%%sql

- find the company that has the smallest payroll

SELECT company_name
FROM works
GROUP BY company_name
HAVING SUM(salary) = (
    SELECT MIN(payroll)
    FROM (
        SELECT SUM(salary) AS payroll
        FROM works
        GROUP BY company_name
    ) as payrolls
)

 * mysql+pymysql://dbbook:***@localhost:3306
   mysql+pymysql://root:***@localhost:3306
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '- find the company that has the smallest payroll\n\nSELECT company_name\nFROM works' at line 1")
[SQL: - find the company that has the smallest payroll

SELECT company_name
FROM works
GROUP BY company_name
HAVING SUM(salary) = (
    SELECT MIN(payroll)
    FROM (
        SELECT SUM(salary) AS payroll
        FROM works
        GROUP BY company_name
    ) as payrolls
)]
(Background on this error at: http://sqlalche.me/e/f405)